Tekla Open API Reference for Tekla Structures 2025
IGeometryNodeVisitor.Visit Method (CylindricalSurfaceNode)
 Visits a node that is an instance of CylindricalSurfaceNode
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
void Visit(
	CylindricalSurfaceNode node
)
Sub Visit (
	node As CylindricalSurfaceNode
)
Parameters
node
Type: Tekla.Structures.Model.CylindricalSurfaceNode
[Missing <param name="node"/> documentation for "M:Tekla.Structures.Model.IGeometryNodeVisitor.Visit(Tekla.Structures.Model.CylindricalSurfaceNode)"]
See Also
Reference
IGeometryNodeVisitor Interface
Visit Overload
Tekla.Structures.Model Namespace